# Реализовать класс Road (дорога).
# определить атрибуты: length (длина), width (ширина);
# значения атрибутов должны передаваться при создании экземпляра класса;
# атрибуты сделать защищёнными;
# определить метод расчёта массы асфальта, необходимого для покрытия всей дороги;
# использовать формулу:
# длина*ширина*масса асфальта для покрытия одного кв. метра дороги асфальтом, толщиной в 1 см*число см толщины полотна;
# проверить работу метода.
# Например: 20 м*5000 м*25 кг*5 см = 12500 т.

class Road:
    __square_mass = 25

    def __init__(self, lenght, width):
        self._lenght = lenght
        self._width = width

    def weight(self, height):
        print(f'coverage weight is: {self._lenght * self._width * self.__square_mass * height / 1000} t')


my_road = Road(5200, 10)
my_road.weight(10)
